perf/service-a.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
      - name: BeginPad
        duration: 30
        arrivalRate: 0
      - name: Ramp
        duration: 30 
        arrivalRate: 0
        rampTo: 10
      - name: Plain
        duration: 60
        arrivalRate: 10
      - name: EndPad
        duration: 30
        arrivalRate: 0

scenarios:
  - name: Service A (/service-a)
    flow:
      - get:
          url: '/service-a'